Rails/practice/app/controllers/students_controller.rb

  def index

    @students = Student.all
---
SELECT * FROM "students"

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 4)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "marks", "updated_at", "rank", "created_at") VALUES('Kalarani', 10, '2019-01-10 06:16:25', 1, '2019-01-10 06:16:25')

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT * FROM "students" WHERE ("students"."id" = 4)
UPDATE "students" SET "updated_at" = '2019-01-10 06:17:05', "marks" = 100 WHERE "id" = 4

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1